/*
* Д / З:
* Дан ряд Фибоначчи.
* Найти сумму всех четных элементов ряда Фибоначчи,
* которые не превышают 4 миллиона.
*/

#include <stdio.h>

int main()
{
	int n[3] = { 0 };
	n[0] = 0;
	n[1] = 1;
	n[2] = 1;
	int s = 0;
	while (n[2] <= 4000000)
	{
		n[0] = n[1] + n[2];
		n[1] = n[0] + n[2];
		n[2] = n[0] + n[1];
		printf("%d %d %d", n[0], n[1], n[2]);
		if (n[0] <= 4000000 && n[0] % 2 == 0)
			s += n[0];
		if (n[1] <= 4000000 && n[1] % 2 == 0)
			s += n[1];
		if (n[2] <= 4000000 && n[2] % 2 == 0)
			s += n[2];
	}
	printf("%d", s);
	return s;
}